"use strict";
if (confirm('Почати тестування?')) {
	// 	Задача 1. Дано масив рядків. Вивести ті, у яких є цифри
	// (використати метод test та регулярні вирази).
	// const arr = [15, 'car', 589, 'coffe', 41, 52, 'Olga', 'book', 'BMV', 2025]
	// const listString = arr.join(',')
	// document.write(listString.match(/\d*/g))
	//======================================================================

	// Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.
	// const arr = [15, 'car', 589, 'coffe', 41, 52, 'Olga', 'book', 'BMV', 2025]
	// const listString = arr.join(',')
	// document.write(listString.match(/\D*/g))
	//=================================================

	// Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.
	// const arr = [15, 'car', 589, 'coffe', 41, 52, 'Olga', 'book', 'BMV', 2025]
	// let exp = /(a|o|i|e|u)/gi
	// for (const element of arr) {
	// 	if (exp.test(element)) {
	// 		document.write(`${element}, `)
	// 	}
	// }
	//===================================================

	// Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.
	// const arr = [15, 'car', 589, 'coffe', 41, 52, 'Olga', 'book', 'BMV', 2025]
	// let exp = /(a|o|i|e|u)/gi
	// for (const element of arr) {
	// 	if (!exp.test(element) && /\D/.test(element)) {
	// 		document.write(`${element}, `)
	// 	}
	// }
	//========================================================

	// Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.
	// const arr = [15, 'car', 583, 'coffe', 41, 52, 'Olga', 'book', 'BMV', 2025]
	// for (const element of arr) {
	// 	if (/(1|3)/i.test(element)) {
	// 		document.write(`${element}, `)
	// 	}
	//}
	//======================================================

	// Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.
	// const string1 = 'Дан0 ряд0к тексту, вивести ус1 4исла, як1 є у текст1'
	// document.write(string1.match(/\d/g))
	//======================================================

	// Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.
	// const string2 = 'Given a string of text. Find all punctuation marks that have been used.'
	// document.write(string2.match(/\W/g))
	//=======================================================

	// Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.
	// const string3 = 'Given a, string of text. Display all components, that are separated by punctuation marks.'
	// document.write(string3.match(/\w\W\s\w/g))
	//======================================================

	// Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).
	// const string4 = 'Сьогодні 10.10.2025 буде хмарно з проясненням, часом невеликий дощ.'
	// if (/\d{2}\.\d{2}\.20\d{2}/) {
	// 	document.write('Текст містить дата у форматі dd.mm.yyyy')
	// } else document.write('Дата не відповідає вказаному формату')
	//============================================

	// Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.
	// const string5 = 'Вітер 7-12 м/с, часом пориви 15-20 м/с. Температура по області  10-15º тепла.'
	// let num = string5.match(/\d{2}/g)
	// document.write(`В рядку ${num.length} двоцифрових чисел`)
	//===================================================

	// Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434» ).
	//  Знайти усі такі номери (при цьому символи “-” можуть бути, а можуть і не бути, тобто так «4142343323233434».
	// const string6 = '4142-3433-2323-3434, 4142343323233434, 41422323.3434, 2584, FX1254OK'
	// const cardsNumber = string6.match(/\d{4}-?\d{4}-?\d{4}-?\d{4}/g)
	// document.write(cardsNumber)
	//=======================================================

	// Задача 12. Дано адресу сайту. Визначити, чи є він урядовим
	// (містить домен “gov”, але не обов”язково у кінці). Наприклад: “https://company.gov.ua”
	// const string7 = 'https://company.gov.ua'
	// if (string7.match(/\.gov\.?/)) document.write('Сайт урядовий')
	// else document.write('Сайт не урядовий')
	//==============================================================

	// Задача 13. Вибрати усі роки між 2020 та 2049 з отриманого повідомлення
	// const list = '2025, 2015, 2037, 2020, 2049, 2018, 2041'
	// document.write(list.match(/20[2-4][0-9]/g))
	//===============================================

	// Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном оператора Киїівстар
	// const telNumber = '0634512879'
	// const exp = /(098|068|096|067|077)\d{7}/
	// if (exp.test(telNumber)) alert('Київстар')
	// else alert('Не Київстар')
	//====================================

	// Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.
	// let userName = prompt('Введіть прізвище та ім\'я').trim()
	// let userName2 = userName.replace(' ', '-')
	// document.write(userName2)
	//================================

	// Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «місяць/рік»
	// const userDate = prompt('Введіть дату у форматі «день.місяць.рік»').trim()
	// const userDateArr = userDate.replaceAll(/(\d{2})\.(\d{2})\.(\d{4})/g, "$2/$3")
	// document.write(userDateArr)
}